module.exports = app => {
  // router
  require("./crud")(app);
  require("./auth")(app);
  require("./upload")(app);

  const Category = require("./../../../libs/db/models/Category");
  const Article = require("./../../../libs/db/models/Article");
  app.use("/w/init/news", async (req, res, next) => {
    const cat = await Category.findOne({ name: "模拟战大师赛" });

    let n = [
      {
        title:
          "王者模拟战职业大师赛第五周高分组快讯：百花齐放，三星九蜀蔡文姬奶出一片天",
      },
      {
        title:
          "王者模拟战职业大师赛快讯：三星宫本团战大招无限连，以一敌多强无敌",
      },
      { title: "王者模拟战职业大师赛第四周：KSSC稳坐高分组，RW侠再现冠军风采" },
      { title: "S2王者模拟战，新手一图了解天元赛的那些事儿！" },
      {
        title:
          "王者模拟战职业大师赛第四周低分组快讯：登顶阵容百花齐放，刺客内战三星宫本挽狂澜",
      },
      {
        title:
          "王者模拟战职业大师赛第四周高分组快讯：攻辅神射三连登顶，蜀国战士备受青睐",
      },
      {
        title:
          "王者模拟战职业大师赛快讯：三星武则天毁天灭地！连续两场觉醒清屏！",
      },
      {
        title:
          "王者模拟战棋思妙想夜：主播vs职业！四局比赛登顶三局，成都AG.百里真的强！",
      },
      {
        title:
          "王者模拟战职业大师赛第三周：TES稳中有升，46积分破记录傲视高分组",
      },
      { title: "五五开黑乐，王者模拟战-棋思妙想夜，棋友一起来狂欢！" },
      {
        title:
          "王者模拟战职业大师赛快讯：低分组刺客阵容多次登顶，三星李白成型光速清场",
      },
      {
        title:
          "王者模拟战职业大师赛5月2日快讯：扶桑刺客昙花一现，高分组多家阵容各显神通",
      },
      {
        title:
          "王者模拟战职业大师赛5月1日快讯：稷下战士退下神坛，扶桑刺客强势崛起",
      },
      { title: "王者模拟战职业大师赛第三周看点解读：各组重新洗牌，卧虎又藏龙" },
      {
        title:
          "王者模拟战职业大师赛第二周，NMG破纪录三连登顶！45总积分一骑绝尘",
      },
      { title: "王者模拟战职业大师赛快讯：三星黄忠照样撂倒，稷下战士强横无比" },
      {
        title:
          "王者模拟战职业大师赛快讯：稷下战士暴力输出碾压全场，攻辅射输出拉满首登顶",
      },
      {
        title: "王者模拟战职业大师赛快讯：中分组九家战士大混战，九蜀成功下天山",
      },
      { title: "王者模拟战职业大师赛第二周看点解读：神仙打架&amp;黑马逆袭" },
      {
        title: "王者模拟战职业大师赛首周对抗，成都AG、武汉ES登顶二连闯入高分组",
      },
      {
        title:
          "王者模拟战职业大师赛快讯：C组百花齐放，长城小鲁班枪枪烈火成功登顶",
      },
      {
        title:
          "王者模拟战职业大师赛快讯：杨玉环稷下战士强无敌，博学者之怒定乾坤",
      },
      {
        title:
          "王者模拟战职业大师赛快讯：奶法&amp;稷下战士双分天下，各登顶两次",
      },
      { title: "2020年王者模拟战职业大师赛首周看点解读，老牌强队vs模拟战新秀" },
      { title: "王者模拟战职业大师赛-春季赛常规赛第一周选手首发名单" },
      { title: "王者模拟战职业大师赛春季赛规则讲解及赛程公布" },
      { title: "2020年王者模拟战职业大师赛春季赛正式大名单公布" },
      { title: "2020年王者模拟战职业大师赛春季赛大名单（首批）公布" },
      {
        title:
          "王者模拟战职业大师赛-春季赛4月17日正式开赛！全新赛制助力24支战队战火升级",
      },
      { title: "王者模拟战职业大师赛春季赛预选赛圆满结束！" },
      {
        title:
          "棋王辈出，龙争虎斗！王者模拟战职业大师赛·预选赛首轮便知潜力无限",
      },
      {
        title:
          "12支预选赛战队集结，2020年王者模拟战职业大师赛-春季赛预选赛3月16日开战",
      },
      { title: "群雄博弈对战峡谷，2020年王者模拟战职业大师赛-春季赛强势来袭" },
      { title: "教你赚更多的钱！新版本模拟战如何利用特价甩卖与天赋重铸？" },
      { title: "模拟战干货分享：上分快人一步！新赛季封神版本最强阵容推荐" },
      {
        title:
          "冬冠团聚夜王者模拟战双人表演赛落幕，斗鱼.白白白白白扶桑法刺带琪琪登顶",
      },
      { title: "冬冠团聚夜来袭，王者模拟战双人表演赛今日18:00等你来看" },
      { title: "侠客无畏秀出自我，RW侠成功登顶王者模拟战冬冠邀请赛总冠军" },
      { title: "王者模拟战冬冠邀请赛快讯：纳兰手手神奇坦射助RW侠夺冠" },
      {
        title:
          "王者模拟战冬季冠军杯邀请赛总决赛今日15:30开战，一起见证棋王诞生",
      },
      {
        title:
          "王者模拟战冬冠邀请赛快讯：三星黄忠爆炸输出成功登顶，八强聚首会师总决赛",
      },
      {
        title:
          "王者模拟战冬冠邀请赛快讯：长城射1血惊险获胜，七蜀下天山爆冷夺魁",
      },
      { title: "王者模拟战冬冠邀请赛组流阵容经久不衰，战坦刺法轮流夺魁" },
      { title: "王者模拟战冬冠邀请赛快讯：长城射手依旧强势，刺客大战精彩纷呈" },
      { title: "王者模拟战冬冠邀请赛16进8今日16:00开战，各路棋王决战峡谷" },
      { title: "策略与微操的结合！模拟战冬季冠军杯32进16名额出炉" },
      {
        title:
          "王者模拟战冬冠杯邀请赛快讯：魏国战士流满血第一，三星武则天输出爆表！",
      },
      { title: "王者模拟战冬冠杯邀请赛快讯：百家争鸣大魏天下流夺头魁" },
      {
        title:
          "王者模拟战冬冠杯邀请赛快讯：韩国选手集齐三星吕布，小浪晨z三连第一带队晋级",
      },
      { title: "王者模拟战冬冠杯邀请赛快讯：战士克星名不虚传，射手阵容显神威" },
    ];

    n = n.map(item => ({
      title: item.title,
      categories: [cat._id],
    }));
    const items = await Article.insertMany(n);
    res.send(items);
    // res.send(n);
  });
};
